tips = {
    //-------------------------------整车数据-----------------------------------
    //车辆状态
    "vehicleStatus" : "0x01:车辆启动状态;<br/>0x02:熄火;<br/>0x03:其他状态;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //充电状态
    "chargeStatus" : "0x01:停车充电;<br/>0x02:行驶充电;<br/>0x03:未充电状态;<br/>0x04:充电完成;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //运行模式
    "powerMode" : "0x01:纯电;<br/>0x02:混动;<br/>0x03:燃油;<br/>0xFE:表示异常;<br/>0xFF:表示无效",
    //车速
    "speed" : "有效值范围:0~2200(表示0km/h~220km/h)，最小计量单元:0.1km/h;<br/>\"0xFF,0xFE\"表示异常;<br/>\"0xFF,0xFF\"表示无效。",
    //累计里程
    "totalMileage" : "有效值范围:0~9999999(表示0km~999999.9km)，最小计量单元:0.1km;<br/>\"0xFF,0xFF,0xFF,0xFE\"表示异常;<br/>\"0xFF,0xFF,0xFF,0xFF\"表示无效。",
    //总电压
    "totalVoltage" : "有效值范围:0~10000(表示0V~1000V)，最小计量单元:0.1V;<br/>\"0xFF,0xFE\"表示异常;<br/>\"0xFF,0xFF\"表示无效。",
    //总电流
    "totalCurrent" : "有效值范围:0~10000(偏移量1000A，表示-1000A~+1000A)，最小计量单元:0.1A;<br/>\"0xFF,0xFE\"表示异常;<br/>\"0xFF,0xFF\"表示无效。",
    //SOC
    "soc" : "有效值范围:0~100(表示0%~100%)，最小计量单元:1%;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //DC-DC状态
    "DC-DCStatus" : "0x01:工作;<br/>0x02:断开;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //档位
    "gear" : "<b>bit0~bit3:</b><br/>" +
        "&nbsp;&nbsp;&nbsp;&nbsp;0000-空档;<br/>" +
        "&nbsp;&nbsp;&nbsp;&nbsp;0001-1档;<br/>" +
        "&nbsp;&nbsp;&nbsp;&nbsp;0010-2档;<br/>" +
        "&nbsp;&nbsp;&nbsp;&nbsp;0011-3档;<br/>" +
        "&nbsp;&nbsp;&nbsp;&nbsp;0100-4档;<br/>" +
        "&nbsp;&nbsp;&nbsp;&nbsp;0101-5档;<br/>" +
        "&nbsp;&nbsp;&nbsp;&nbsp;0110-6档;<br/>" +
        "&nbsp;&nbsp;&nbsp;&nbsp;……;<br/>" +
        "&nbsp;&nbsp;&nbsp;&nbsp;1101-倒档;<br/>" +
        "&nbsp;&nbsp;&nbsp;&nbsp;1110-自动D档;<br/>" +
        "&nbsp;&nbsp;&nbsp;&nbsp;1111-停车P档;<br/>" +
        "<b>bit4:</b>1-制动有效;0-制动无效;<br/>" +
        "<b>bit5:</b>1-驱动有效;0-驱动无效;<br/>" +
        "<b>bit6~bit7:</b>预留，用0表示。",
    //绝缘电阻
    "insulationResistance" : "有效值范围:0~60000(表示0kΩ~60000kΩ),最小计量单元:1kΩ。",
    //加速踏板行程值
    "acceleratorPedal" : "有效值范围:0~100(表示0%~100%)，最小计量单元:1%;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //制动踏板状态
    "brakePedal" : "有效值范围:0~100(表示0%~100%)，最小计量单元:1%;<br/>0表示制动关的状态;在无具体行程值情况下，用0x65即101表示制动有效状态;<br/>0xFE:表示异常<br/>0xFF:表示无效。",
    //-------------------------------驱动电机数据-----------------------------------
    //驱动电机个数
    "driverCount" : "有效值范围:1~253。",
    //驱动电机序号
    "driverNo" : "有效值范围:1~253。",
    //驱动电机状态
    "driverStatus" : "0x01:耗电;<br/>0x02:发电;<br/>0x03:关闭状态;<br/>0x04:准备状态;<br/>0xFE:表示异常，<br/>0xFF:表示无效。",
    //驱动电机控制器温度
    "driverCtrlTemp" : "有效值范围:0~250(数值偏移量40℃，表示-40℃~+210℃)，最小计量单元:1℃;<br/>0xFE:表示异常，<br/>0xFF:表示无效。",
    //驱动电机转速
    "driverRPM" : "有效值范围:0~65531(数值偏移量20000表示-20000r/min~45531r/min)，最小计量单元:1r/min;<br/>\"0xFF，0xFE\":表示异常<br/>\"0xFF，0xFF\":表示无效。",
    //驱动电机转矩
    "driverTorque" : "有效值范围:0~65531(数值偏移量20000表示-2000N*m~4553.1N*m)，最小计量单元:0.1N*m;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //驱动电机温度
    "driverTemp" : "有效值范围:0~250(数值偏移量40℃，表示-40℃~+210℃)，最小计量单元:1℃;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //电机控制器输入电压
    "ctrlInputVoltage" : "有效值范围:0~60000(表示0V~5000V)，最小计量单元:0.1V;<br/>\"0xFF,0xFE\":表示异常;<br/>\"0xFF,0xFF\":表示无效。",
    //电机控制器直流母线电流
    "ctrlDCBusCurrent" : "有效值范围:0~20000(数值偏移量1000，表示-1000A~+1000A)，最小计量单元:0.1A;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //-------------------------------燃料电池数据-----------------------------------
    //燃料电池电压
    "fuelCellVoltage" : "有效值范围:0~20000(表示0V~2000V)，最小计量单元:0.1V;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //燃料电池电流
    "fuelCellCurrent" : "有效值范围:0~20000(表示0A~+2000A)，最小计量单元;0.1A;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //燃料消耗率
    "fuelConsumptionRate" : "有效值范围:0~60000(表示0kg/100km~600kg/100km)，最小计量单元:0.01kg/100km;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\"表示无效。",
    //燃料电池温度探针总数
    "probeCount" : "有效值范围:1~250。",
    //探针温度值
    "probeTemp" : "有效值范围:0~2400(偏移量40℃，表示-40℃~200℃)，最小计量单元:0.1℃;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //氢系统中最高温度
    "hydrogenSysMaxTemp" : "有效值范围:0~2400(偏移量40℃，表示-40℃~200℃)，最小计量单元:0.1℃;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //氢系统中最高温度探针代号
    "maxTempProbeNo" : "有效值范围:1~252;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //氢气最高浓度
    "hydrogenMaxConcentration" : "有效值范围:0~60000(表示0mg/KG~50000MG/KG)，最小计量单元:1mg/kg;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //氢气最高浓度传感器代号
    "maxConcentrationSensorNo" : "有效值范围:1~252;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //氢气最高压力
    "hydrogenMaxPressure" : "有效值范围:0~1000(表示0MPa~100Mpa),最小计量单元:0.1Mpa。",
    //氢气最高压力传感器代号
    "maxPressureSensorNo" : "有效值范围:1~252;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //高压DC/DC状态
    "highTensionDC-DCstatus" : "0x01:工作;0x02:断开;<br/>0xFE:表示异常，0xFF:表示无效。",
    //-------------------------------发动机数据-----------------------------------
    //发动机状态
    "motorStatus" : "0x01:启动状态;0x02:关闭状态;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //曲轴转速
    "motorRPM" : "有效范围:0~60000(表示0r/min~60000r/min)，最小计量单元:1r/min;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //燃料消耗率
    "motorFuelConsumptionRate" : "有效值范围:0~60000(表示0L/100km~600L/100km)，最小计量单元:0.01L/100km;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //-------------------------------位置数据-----------------------------------
    //定位状态
    "positionStatus" : "<b>bit0:</b>0-有效定位;1-无效定位(当数据通信正常，而不能获取定位信息时，发送最后一次有效定位信息，并将定位状态置为无效。)<br/><b>bit1:</b>0-北纬;1-南纬<br/><b>bit2:</b>0-东经;1-西经<br/><b>bit3~bit7:</b>预留，用0表示。",
    //经度
    "longitude" : "以度为单位的经度值乘以10的6次方，精确到百万分之一度。",
    //纬度
    "latitude" : "以度为单位的纬度值乘以10的6次方，精确到百万分之一度。",
    //-------------------------------极值数据-----------------------------------
    //最高电压电池子系统号
    "maxVoltageSubSysNo" : "有效值范围:1~250;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //最高电压电池单体代号
    "maxVoltageCellNo" : "有效值范围:1~250;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //最高电压
    "maxVoltage" : "有效值范围:0~15000(表示0V~15V)，最小计量单元:0.001V;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //最低电压电池子系统号
    "minVoltageSubSysNo" : "有效值范围:1~250;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //最低电压电池单体代号
    "minVoltageCellNo" : "有效值范围:1~250;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //最低电压
    "minVoltage" : "有效值范围:0~15000(表示0V~15V)，最小计量单元:0.001V;<br/>\"0xFF，0xFE\":表示异常，\"0xFF，0xFF\":表示无效。",
    //最高温度子系统号
    "maxTempSubSysNo" : "有效值范围:1~250;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //最高温度探针序号
    "maxTempProbeNo" : "有效值范围:1~250;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //最高温度
    "maxTemp" : "有效值范围:0~250(数值偏移量40℃，表示-40℃~+210℃)，最小计量单元:1℃;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //最低温度子系统号
    "minTempSubSysNo" : "有效值范围:1~250;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //最低温度探针序号
    "minTempProbeNo" : "有效值范围:1~250;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //最低温度
    "minTemp" : "有效值范围:0~250(数值偏移量40℃，表示-40℃~+210℃)，最小计量单元:1℃;<br/>\0xFE:表示异常;<br/>0xFF:表示无效。",
    //-------------------------------报警数据-----------------------------------
    //最高报警等级
    "maxAlarmLevel" : "为当前发生的故障中的最高等级值，有效值范围:0~3;<br/>" +
        "0-无故障;<br/>" +
        "1-1级故障，指代不影响车辆正常行驶的故障;<br/>" +
        "2-2级故障，指代影响车辆性能，需驾驶员限制行驶的故障;<br/>" +
        "3表示3级故障，为最高级别故障，指代驾驶员应立即停车处理或请求救援的故障;<br/>" +
        "具体等级对应的故障内容由厂商自行定义;<br/>" +
        "0xFE:表示异常，0xFF:表示无效。",
    //通用报警标志
    "generalAlarmFlag" : "<b>bit0:</b>1-温度差异报警;0-正常;<br/>" +
        "<b>bit1:</b>1-电池高温报警;0-正常;<br/>" +
        "<b>bit2:</b>1-车载储能装置类型过压报警;0-正常;<br/>" +
        "<b>bit3:</b>1-车载储能装置类型欠压报警;0-正常;<br/>" +
        "<b>bit4:</b>1-SOC低报警;0-正常;<br/>" +
        "<b>bit5:</b>1-单体电池过压报警;0-正常;<br/>" +
        "<b>bit6:</b>1-单体电池欠压报警;0-正常;<br/>" +
        "<b>bit7:</b>1-SOC过高报警;0-正常;<br/>" +
        "<b>bit8:</b>1-SOC跳变报警;0-正常;<br/>" +
        "<b>bit9:</b>1-可充电储能系统不匹配报警;0-正常;<br/>" +
        "<b>bit10:</b>1-电池单体一致性差报警;0-正常;<br/>" +
        "<b>bit11:</b>1-绝缘报警;0-正常;<br/>" +
        "<b>bit12:</b>1-DCDC温度报警;0-正常;<br/>" +
        "<b>bit13:</b>1-制动系统报警;0-正常;<br/>" +
        "<b>bit14:</b>1-DCDC状态报警;0-正常;<br/>" +
        "<b>bit15:</b>1-驱动电机控制器温度报警;0-正常;<br/>" +
        "<b>bit16:</b>1-高压互锁状态报警;0-正常;<br/>" +
        "<b>bit17:</b>1-驱动电机温度报警;0-正常;<br/>" +
        "<b>bit18:</b>1-车载储能装置类型过充;0-正常;<br/>" +
        "<b>bit19~bit31:</b>预留，用0表示。",
    //可充电储能装置故障总数
    "storageDownCnt" : "有效值范围:0~252;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //可充电储能装置故障代码
    "storageDownCode" : "扩展性数据，由厂商自行定义，可充电储能装置故障个数等于可充电储能装置故障总数N。",
    //驱动电机故障总数
    "driverDownCnt" : "有效值范围:0~252;<br/>0xFE:表示异常;<br/>0xFF表示无效。",
    //驱动电机故障代码
    "driverDownCode" : "厂商自行定义，驱动电机故障个数等于驱动电机故障总数N。",
    //发动机故障总数
    "motorDownCnt" : "有效值范围:0~252;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //发动机故障代码
    "motorDownCode" : "厂商自行定义，发动机故障个数等于驱动电机故障总数N。",
    //其他故障总数
    "otherDownCnt" : "有效值范围:0~252;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //其他故障代码
    "otherDownCode" : "厂商自行定义，故障个数等于故障总数N。",
    //-------------------------------可充电储能装置电压数据-----------------------------------
    //可充电储能子系统个数
    "storageSubSysCnt" : "有效值范围:1~250;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //可充电储能子系统号
    "subSysNo" : "有效值范围:1~250。",
    //可充电储能装置电压
    "deviceVoltage" : "有效值范围:0~10000(表示0V~1000V)，最小计量单元:0.1V;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //可充电储能装置电流
    "deviceCurrent" : "有效值范围:0~20000(数值偏移量1000A，表示-1000A~+1000A)，最小计量单元:0.1A;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //单体电池总数
    "cellCnt" : "有效值范围:0~65531;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //本帧起始电池序号
    "frameCellNoStart" : "有效值范围:1~65531;<br/>当本帧单体个数超过200时，应拆分成多帧数据进行传输。",
    //本帧单体电池总数
    "frameCellCnt" : "有效值范围:1~200。",
    //单体电池电压
    "cellVoltage" : "有效值范围:0~60000(表示0V~60.000V)，最小计量单元:0.001V，;<br/>\"0xFF，0xFE\":表示异常，\"0xFF，0xFF\":表示无效。",
    //-------------------------------可充电储能装置温度数据-----------------------------------
    //可充电储能子系统个数
    "tempstorageSubSysCnt" : "有效值范围:1~250;<br/>\0xFE:表示异常;<br/>0xFF:表示无效。",
    //可充电储能子系统号
    "tempsubSysNo" : "有效值范围:1~250。",
    //可充电储能温度探针个数
    "probeCnt" : "有效值范围:1~65531;<br/>\"0xFF，0xFE\":表示异常;<br/>\"0xFF，0xFF\":表示无效。",
    //可充电储能子系统各温度探针检测到的温度值
    "probeTemp" : "有效值范围:0~250(数值偏移量40℃，表示-40℃~+210℃)，最小计量单元:1℃;<br/>0xFE:表示异常;<br/>0xFF:表示无效。",
    //-------------------------------位置拓展数据-----------------------------------
    //方向
    "direction" : "有效值范围:0~359，正北为0，顺时针。",
    //-------------------------------电池状态数据-----------------------------------
    //剩余电量百分比
    "remainderPCT" : "有效值范围:0~254(表示0%~100%)，最小计量单元:0.394%。",
    //剩余可行驶里程
    "residualMileage" : "有效值范围:0~1023公里，精度1。",
    //充电插头连接状态
    "plugConnStatus" : "0x00:未连接;<br/>0x01:连慢充;<br/>0x02:连快充。",
    //剩余充电时间
    "remainderChargeTime" : "有效值范围:0~1023(min)。",
    //电池均衡激活
    "cellEqualization" : "0x01:均衡激活中;<br/>0x00:无均衡",
    //预留
    "reserve" : "预留，用0填充",
    //-------------------------------车门状态数据-----------------------------------
    //车门数据的长度
    "doorDataLength" : "有效值范围:0~65534。",
    //车门数据
    "doorData" : "<b>bit0:</b>0-驾驶员座门未上锁;1-驾驶员座门上锁;<br/>" +
        "<b>bit1:</b>0-中控锁未上锁;1-中控锁上锁;<br/>" +
        "<b>bit2:</b>0-右前门未上锁;1-右前门上锁;<br/>" +
        "<b>bit3:</b>0-右下车门未上锁;1-右下车门上锁;<br/>" +
        "<b>bit4:</b>0-左下车门未上锁;1-左下车门上锁;<br/>" +
        "<b>bit5:</b>0-驾驶员座车门关;1-驾驶员座车门开;<br/>" +
        "<b>bit6:</b>0-右上车门关;1-右上车门开;<br/>" +
        "<b>bit7:</b>0-左下车门关;1-左下车门开;<br/>" +
        "<b>bit8:</b>0-右下车门关;1-右下车门开;<br/>" +
        "<b>bit9:</b>0-后备箱关;1-后备箱开;<br/>" +
        "<b>bit10:</b>0-前盖关;1-前盖开;<br/>" +
        "<b>bit11~bit15:</b>预留，用0表示。",
    //车钥匙
    "key" : "0x01:检测到钥匙在车内;<br/>0x02:检测到钥匙在车外;<br/>0x03:未检测到钥匙。",
    //-------------------------------车灯状态数据-----------------------------------
    //车灯数据的长度
    "lightDataLength" : "有效值范围:0~65534。",
    //车灯数据
    "lightData" : "<b>bit0:</b>0-远光灯关闭;1-远光灯开启;<br/>" +
        "<b>bit1:</b>0-近光灯关闭;1-近光灯开启;<br/>" +
        "<b>bit2:</b>0-位置灯关闭;1-位置灯开启;<br/>" +
        "<b>bit3:</b>0-左转向灯关闭;1-左转向灯开启;<br/>" +
        "<b>bit4:</b>0-右转向灯关闭;1-右转向灯开启;<br/>" +
        "<b>bit5:</b>0-危险报警灯关闭;1-危险报警灯开启;<br/>" +
        "<b>bit6:</b>0-日行灯关闭;1-日行灯开启;<br/>" +
        "<b>bit7:</b>0-防盗喇叭关闭;1-防盗喇叭开启;<br/>" +
        "<b>bit8:</b>0-防盗报警解除;1-防盗报警触发;<br/>" +
        "<b>bit9:</b>0-防盗设防解除;1-防盗设防启动;<br/>" +
        "<b>bit10:</b>0-小灯关闭;1-小灯开启;<br/>" +
        "<b>bit11:</b>0-双闪灯关闭;1-双闪灯开启;<br/>" +
        "<b>bit12:</b>0-后雾灯关闭;1-后雾灯开启;<br/>" +
        "<b>bit13:</b>0-后排阅读灯关闭;1-后排阅读灯开启;<br/>" +
        "<b>bit14~bit15:</b>保留，用0表示。",
    //-------------------------------空调状态数据-----------------------------------
    //空调数据的长度
    "airCondDataLength" : "有效值范围:0~65534。",
    //A/C开关状态
    "ACStatus" : "0x00:空调关闭;<br/>0x01:空调打开。",
    //车内温度值
    "tempGear" : "0x00:关闭;<br/>0x01:一档;<br/>0x02:二档;<br/>0x03:三档;<br/>0x04:四档;<br/>0x05:五档;<br/>0x06:六档;<br/>0x07:七档。",
    //风量调节
    "amountOfWind" : "0x00:关闭;<br/>0x01:一档;<br/>0x02:二档;<br/>0x03:三档;<br/>0x04:四档;<br/>0x05:五档;<br/>0x06:六档;<br/>0x07:七档",
    //出风模式
    "windMode" : "0x00:吹面;<br/>0x01:吹面吹脚;<br/>0x02:吹脚;<br/>0x03:吹脚除雾;<br/>0x04:除雾。",
    //前风档除霜
    "frontWindshieldDefrost" : "0x00:关闭;<br/>0x01:开启。",
    //后风档加热
    "rearWindshieldHeat" : "0x00:关闭;<br/>0x01:开启。",
    //空调控制模式
    "controllMode" : "0x00:无效;<br/>0x01:预热开启;<br/>0x02:预冷开启;<br/>0x03:除霜开启;<br/>0x04:结束关闭。",
    //-------------------------------启动熄火时间数据-----------------------------------
    //启动时间
    "IGNOnTime" : "格式YYMMDDHHMISS，共6字节;<br/>" +
        "<b>年</b>有效值范围:0~99;<br/>" +
        "<b>月</b>有效值范围:1~12;<br/>" +
        "<b>日</b>有效值范围:1~31;<br/>" +
        "<b>时</b>有效值范围:0~23;<br/>" +
        "<b>分</b>有效值范围:0~59;<br/>" +
        "<b>秒</b>有效值范围:0~59。",
    //熄火时间
    "IGNOffTime" : "格式YYMMDDHHMISS，共6字节;<br/>" +
        "<b>年</b>有效值范围:0~99;<br/>" +
        "<b>月</b>有效值范围:1~12;<br/>" +
        "<b>日</b>有效值范围:1~31;<br/>" +
        "<b>时</b>有效值范围:0~23;<br/>" +
        "<b>分</b>有效值范围:0~59;<br/>" +
        "<b>秒</b>有效值范围:0~59。",
    //-------------------------------车辆状态数据-----------------------------------
    //动力系统就绪
    "powerSysReady" : "0x00:未就绪;<br/>0x01:就绪。",
    //紧急下电请求
    "emerPowerDown" : "0x00:正常;<br/>0x01:异常。",
    //车辆当前状态
    "currentStatus" : "0x00:停止;<br/>0x01:行驶;<br/>0x02:充电。"
}
